

Private VLAN Configuration Lab

Overview

This lab demonstrates the configuration and testing of Private VLANs (PVLANs) using a switch and router setup. Private VLANs provide traffic isolation within the same subnet, ensuring controlled communication between devices for enhanced security.

The configuration includes:

* Primary VLAN (10)
* Community VLANs (20, 30)
* Isolated VLAN (40)
* Promiscuous Port (Router)



üñ•Ô∏è Topology

![Private VLAN Topology](Private-Vlan.png)

IP Addressing Scheme (192.168.1.0/24)

| Device    | Interface | IP Address    | VLAN | PVLAN Role            |
| --------- | --------- | ------------- | ---- | --------------------- |
| PC1       | e0        | 192.168.1.1   | 20   | Community (PC1 ‚Üî PC2) |
| PC2       | e0        | 192.168.1.2   | 20   | Community (PC1 ‚Üî PC2) |
| PC3       | e0        | 192.168.1.3   | 30   | Community (PC3 ‚Üî PC4) |
| PC4       | e0        | 192.168.1.4   | 30   | Community (PC3 ‚Üî PC4) |
| PC5       | e0        | 192.168.1.5   | 40   | Isolated              |
| Router R1 | f0/0      | 192.168.1.100 | 10   | Promiscuous           |



PVLAN Configuration

1Ô∏è‚É£ Define VLANs

bash:-

Switch(config)# vlan 10
Switch(config-vlan)# private-vlan primary
Switch(config-vlan)# private-vlan association 20,30,40
!
Switch(config)# vlan 20
Switch(config-vlan)# private-vlan community
!
Switch(config)# vlan 30
Switch(config-vlan)# private-vlan community
!
Switch(config)# vlan 40
Switch(config-vlan)# private-vlan isolated




2Ô∏è‚É£ Configure Host Ports (Community & Isolated)

bash:-

# Example for PC1 (Community VLAN 20)

Switch(config)# interface e0/1
Switch(config-if)# switchport mode private-vlan host
Switch(config-if)# switchport private-vlan host-association 10 20

# Example for PC3 (Community VLAN 30)

Switch(config)# interface e0/3
Switch(config-if)# switchport mode private-vlan host
Switch(config-if)# switchport private-vlan host-association 10 30

# Example for PC5 (Isolated VLAN 40)

Switch(config)# interface e1/1
Switch(config-if)# switchport mode private-vlan host
Switch(config-if)# switchport private-vlan host-association 10 40




3Ô∏è‚É£ Configure Promiscuous Port (Router Connection)

bash :-

Switch(config)# interface e0/0
Switch(config-if)# switchport mode private-vlan promiscuous
Switch(config-if)# switchport private-vlan mapping 10 20,30,40




4Ô∏è‚É£ Verification Commands

bash:-

Switch# show vlan private-vlan
Switch# show interface status




Ping Test Results

‚úÖ Allowed Communication

* PC1 ‚Üî PC2 (Community VLAN 20)
* PC3 ‚Üî PC4 (Community VLAN 30)
* All PCs ‚Üî Router (192.168.1.100)

‚ùå Restricted Communication

* PC1/PC2 ‚Üî PC3/PC4 (Different communities ‚Äì blocked)
* PC5 ‚Üî Any PC (Isolated VLAN ‚Äì blocked)




Key PVLAN Concepts

* Primary VLAN (10): Parent VLAN associated with all secondary VLANs.
* Community VLANs (20, 30): Devices inside the same community can communicate with each other and with the promiscuous port.
* Isolated VLAN (40): Devices cannot talk to each other; only allowed to reach the promiscuous port.
* Promiscuous Port (Router): Can communicate with all VLAN types.



Conclusion

This lab demonstrates the successful implementation of Private VLANs (PVLANs) using primary, community, isolated, and promiscuous configurations.

The setup validates:

* Intra-community communication is allowed
* Inter-community communication is blocked
* Isolated devices can only reach the router
* Promiscuous port has full connectivity


